In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('merged_data_pandas.csv')

In [3]:
df.head()

        city              restaurant_name  rating num_reviews
0  Islamabad              Ranchers - F 11     4.7       5000+
1  Islamabad       Howdy - Centaurus Mall     4.9        100+
2  Islamabad            BRIM Burgers - F7     4.8        500+
3  Islamabad       SMASH'D it - Centaurus     4.3        100+
4  Islamabad  McDonald's - Centaurus Mall     4.8       5000+

In [5]:
df.isnull().sum()

city               0
restaurant_name    0
rating             6
num_reviews        6
dtype: int64

In [6]:
df.describe()

           rating
count  177.000000
mean     4.516384
std      0.613404
min      1.500000
25%      4.500000
50%      4.700000
75%      4.800000
max      5.000000

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 183 entries, 0 to 182
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   city             183 non-null    object
 1   restaurant_name  183 non-null    object
 2   rating           177 non-null    float64
 3   num_reviews      177 non-null    object
dtypes: float64(1), object(3)
memory usage: 5.8+ KB

In [11]:
df1 = df.dropna()

In [12]:
df1.isnull().sum()

city               0
restaurant_name    0
rating             0
num_reviews        0
dtype: int64

In [14]:
df.to_csv("cleaned_food_data.csv", index=False)